/*************************************************************************
 * Element  -  «Description»
 * -------------------
 * Début      : lun. 04 avril 2011 10:23:53 CEST
 * Auteur(s)  : H4215
 *************************************************************************/

//---- Réalisation de la classe <Element> (fichier Element.cpp) ----

//---------------------------------------------------------------- INCLUDE

//-------------------------------------------------------- Include système
using namespace std;

//------------------------------------------------------ Include personnel
#include "Element.hh"

namespace dtd
{
//------------------------------------------------------------- Constantes

//---------------------------------------------------- Variables de classe

//----------------------------------------------------------- Types privés


//----------------------------------------------------------------- PUBLIC
//-------------------------------------------------------- Fonctions amies

//----------------------------------------------------- Méthodes publiques
// type Element::Méthode ( liste de paramètres )
// Algorithme :
//	«TODO»
//{
//} //----- Fin de Méthode

//------------------------------------------------- Surcharge d'opérateurs


//-------------------------------------------- Constructeurs - destructeur
Element::Element()
// Algorithme :
//	«TODO»
{
	//TODO
} //----- Fin de Element


Element::~Element()
// Algorithme :
//	«TODO»
{
	//TODO
} //----- Fin de ~Element


//------------------------------------------------------------------ PRIVE

//----------------------------------------------------- Méthodes protégées

//------------------------------------------------------- Méthodes privées

} // namespace dtd
