/*************************************************************************
 * Content  -  «Description»
 * -------------------
 * Début      : lun. 04 avril 2011 10:23:49 CEST
 * Auteur(s)  : H4215
*************************************************************************/

//---- Réalisation de la classe <Content> (fichier Content.cpp) ----

//---------------------------------------------------------------- INCLUDE

//-------------------------------------------------------- Include système
using namespace std;

//------------------------------------------------------ Include personnel
#include "Content.hh"

namespace dtd
{
//------------------------------------------------------------- Constantes

//---------------------------------------------------- Variables de classe

//----------------------------------------------------------- Types privés


//----------------------------------------------------------------- PUBLIC
//-------------------------------------------------------- Fonctions amies

//----------------------------------------------------- Méthodes publiques
// type Content::Méthode ( liste de paramètres )
// Algorithme :
//	«TODO»
//{
//} //----- Fin de Méthode

//------------------------------------------------- Surcharge d'opérateurs


//-------------------------------------------- Constructeurs - destructeur
Content::Content ( )
// Algorithme :
//	«TODO»
{
	//TODO
} //----- Fin de Content


Content::~Content ( )
// Algorithme :
//	«TODO»
{
	//TODO
} //----- Fin de ~Content


//------------------------------------------------------------------ PRIVE

//----------------------------------------------------- Méthodes protégées

//------------------------------------------------------- Méthodes privées

} // namespace dtd
