/*************************************************************************
 * Node  -  «Description»
 * -------------------
 * Début      : lun. 04 avril 2011 08:59:41 CEST
 * Auteur(s)  : H4215
 *************************************************************************/

//---- Réalisation de la classe <Node> (fichier Node.cpp) ----

//---------------------------------------------------------------- INCLUDE

//-------------------------------------------------------- Include système
using namespace std;

//------------------------------------------------------ Include personnel
#include "Node.hh"
#include "CompositeMarkupNode.hh"

namespace xml
{
//------------------------------------------------------------- Constantes

//---------------------------------------------------- Variables de classe

//----------------------------------------------------------- Types privés


//----------------------------------------------------------------- PUBLIC
//-------------------------------------------------------- Fonctions amies


//----------------------------------------------------- Méthodes publiques
Node* Node::parent() const
{
	if (_parent == 0)
		return 0;
	else
		return *_parent;
}

//------------------------------------------------- Surcharge d'opérateurs


//-------------------------------------------- Constructeurs - destructeur
Node::Node(CompositeMarkupNode ** parent) :
	_parent(parent)
{
	// Rien à faire
}

Node::~Node()
{
	// Rien à faire
}

//------------------------------------------------------------------ PRIVE

//----------------------------------------------------- Méthodes protégées

//------------------------------------------------------- Méthodes privées

} // namespace xml
